/**@file   bsp_cfg.c
* @brief   bsp接口配置
* @version 1.00.0.0
**************************************************************************************************/

/**************************************************************************************************
*                                      INCLUDE FILES
**************************************************************************************************/

#include "bsp_cfg.h"
#include "stdio.h"

/**************************************************************************************************
*                                      MACROS DEFINE
**************************************************************************************************/

/**************************************************************************************************
*                                      DATA TYPES
**************************************************************************************************/


/**************************************************************************************************
*                                      VARIABLES
**************************************************************************************************/


/**************************************************************************************************
*                                      FUNCTION PROTOTYPES
**************************************************************************************************/

__weak void spi1_receive(uint8_t *data, uint16_t len)
{
    /* spi接收数据 */

    /* 接口函数定义,定义参数,返回值类型和函数名,函数内容在调用模块实现 */
}
__weak void spi2_receive(uint8_t *data, uint16_t len)
{
    /* spi接收数据 */

    /* 接口函数定义,定义参数,返回值类型和函数名,函数内容在调用模块实现 */
}
__weak void spi3_receive(uint8_t *data, uint16_t len)
{
    /* spi接收数据 */

    /* 接口函数定义,定义参数,返回值类型和函数名,函数内容在调用模块实现 */
}
__weak void spi4_receive(uint8_t *data, uint16_t len)
{
    /* spi接收数据 */

    /* 接口函数定义,定义参数,返回值类型和函数名,函数内容在调用模块实现 */
}
__weak void spi6_receive(uint8_t *data, uint16_t len)
{
    /* spi接收数据 */

    /* 接口函数定义,定义参数,返回值类型和函数名,函数内容在调用模块实现 */
}
__weak void qspi_receive(uint8_t *data, uint16_t len)
{
    /* spi接收数据 */

    /* 接口函数定义,定义参数,返回值类型和函数名,函数内容在调用模块实现 */
}
__weak void uart3_receive(uint8_t *data, uint16_t len)
{
    /* 串口接收数据 */

    /* 接口函数定义,定义参数,返回值类型和函数名,函数内容在调用模块实现 */
}
__weak void uart4_receive(uint8_t *data, uint16_t len)
{
    /* 串口接收数据 */

    /* 接口函数定义,定义参数,返回值类型和函数名,函数内容在调用模块实现 */
}
__weak void uart5_receive(uint8_t *data, uint16_t len)
{
    /* 串口接收数据 */

    /* 接口函数定义,定义参数,返回值类型和函数名,函数内容在调用模块实现 */
}
__weak void uart6_receive(uint8_t *data, uint16_t len)
{
    /* 串口接收数据 */

    /* 接口函数定义,定义参数,返回值类型和函数名,函数内容在调用模块实现 */
}
__weak void uart7_receive(uint8_t *data, uint16_t len)
{
    /* 串口接收数据 */

    /* 接口函数定义,定义参数,返回值类型和函数名,函数内容在调用模块实现 */
}
__weak void uart8_receive(uint8_t *data, uint16_t len)
{
    /* 串口接收数据 */

    /* 接口函数定义,定义参数,返回值类型和函数名,函数内容在调用模块实现 */
}
void Error_Handler(void)
{
    
}

